#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113502103542]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113502103553]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113502103544]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113502103549]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113502103548]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113502103543]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113502103551]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113502103547]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113502103550]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113502103545]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113402076881]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113502103552]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113502103567]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113502103570]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113502103571]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113502103559]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113502103562]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113502103561]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113502103557]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113502103560]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113502103563]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113502103554]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113502103565]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113502103564]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113502103582]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113502103598]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113502103578]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113502103580]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113502103581]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113502103590]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113502103572]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113502103579]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113502103577]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113502103606]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113502103609]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113502103612]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15641]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113502103567" -> (known after apply)
        name              = "k8s-dev-control-plane-1"
      ~ server_id         = "113502103606" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113502103570" -> (known after apply)
        name              = "k8s-dev-control-plane-2"
      ~ server_id         = "113502103609" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113502103571" -> (known after apply)
        name              = "k8s-dev-control-plane-3"
      ~ server_id         = "113502103612" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113502103559" -> (known after apply)
        name              = "k8s-dev-router-1"
      ~ server_id         = "113502103572" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103561" -> (known after apply)
        name              = "k8s-dev-worker-node-1"
      ~ server_id         = "113502103577" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103563" -> (known after apply)
        name              = "k8s-dev-worker-node-2"
      ~ server_id         = "113502103580" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103564" -> (known after apply)
        name              = "k8s-dev-worker-node-3"
      ~ server_id         = "113502103581" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103554" -> (known after apply)
        name              = "k8s-dev-worker-node-4"
      ~ server_id         = "113502103578" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103565" -> (known after apply)
        name              = "k8s-dev-worker-node-5"
      ~ server_id         = "113502103582" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103562" -> (known after apply)
        name              = "k8s-dev-worker-node-6"
      ~ server_id         = "113502103579" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103560" -> (known after apply)
        name              = "k8s-dev-worker-node-7"
      ~ server_id         = "113502103598" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502103557" -> (known after apply)
        name              = "k8s-dev-worker-node-8"
      ~ server_id         = "113502103590" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113502103567",
        ] -> (known after apply)
        id               = "113502103606"
        name             = "k8s-dev-control-plane-1"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113502103570",
        ] -> (known after apply)
        id               = "113502103609"
        name             = "k8s-dev-control-plane-2"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113502103571",
        ] -> (known after apply)
        id               = "113502103612"
        name             = "k8s-dev-control-plane-3"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks            = [
          - "113502103559",
        ] -> (known after apply)
        id               = "113502103572"
        name             = "k8s-dev-router-1"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103561",
          - "113502103545",
        ] -> (known after apply)
        id               = "113502103577"
        name             = "k8s-dev-worker-node-1"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103563",
          - "113502103549",
        ] -> (known after apply)
        id               = "113502103580"
        name             = "k8s-dev-worker-node-2"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103564",
          - "113502103547",
        ] -> (known after apply)
        id               = "113502103581"
        name             = "k8s-dev-worker-node-3"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103554",
          - "113502103548",
        ] -> (known after apply)
        id               = "113502103578"
        name             = "k8s-dev-worker-node-4"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103565",
          - "113502103552",
        ] -> (known after apply)
        id               = "113502103582"
        name             = "k8s-dev-worker-node-5"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103562",
          - "113502103544",
        ] -> (known after apply)
        id               = "113502103579"
        name             = "k8s-dev-worker-node-6"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103560",
          - "113502103551",
        ] -> (known after apply)
        id               = "113502103598"
        name             = "k8s-dev-worker-node-7"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502103557",
          - "113502103550",
        ] -> (known after apply)
        id               = "113502103590"
        name             = "k8s-dev-worker-node-8"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>